Revit 2024 API
Units.DecimalSymbol Property
 The symbol used to separate the integer and fractional parts of a number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DecimalSymbol DecimalSymbol { get; set; }
Visual Basic
Public Property DecimalSymbol As DecimalSymbol
	Get
	Set
Visual C++
public:
property DecimalSymbol DecimalSymbol {
	DecimalSymbol get ();
	void set (DecimalSymbol value);
}
Field Value
 The decimal symbol. The default is Dot.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace